// app.js
App({
  onLaunch() {
    // 展示本地存储能力
    const logs = wx.getStorageSync('logs') || []
    logs.unshift(Date.now())
    wx.setStorageSync('logs', logs)

    // 登录
    wx.login({
      success: res => {
        // 发送 res.code 到后台换取 openId, sessionKey, unionId
      }
    })
  },
  globalData: {
    username:null,
    avatarUrl:null,
    openid:null,
    healthmenu:[
      {
        "id":0,
        "title":"莲藕排骨汤",
        "description":"原料：排骨、莲藕、胡萝卜、黑木耳、生姜、葱绿、料酒、食盐",
        "methos":"1：此菜都是本身十分鲜美的食材，所以不用加味精，以免破坏海鲜原本的鲜味。2：虾本身是咸的，日本豆腐也是咸的，所以盐的用量要酌情添加。以免太咸。3：虾背上的虾线，是虾未排泄完的废物，假如吃到口内有泥腥味，影响食欲，所以最好去掉。",
        "imgsrc":"../../images/莲藕排骨汤.jpg"
      },
      {
       "id":1,
       "title":"芦笋鸡肉随行杯",
       "description":"原料：鸡小胸肉、红薯、鸡蛋、番茄、芦笋、胭脂番石榴、油、盐、黑胡椒",
       "methos":"1：此菜都是本身十分鲜美的食材，所以不用加味精，以免破坏海鲜原本的鲜味。2：虾本身是咸的，日本豆腐也是咸的，所以盐的用量要酌情添加。以免太咸。3：虾背上的虾线，是虾未排泄完的废物，假如吃到口内有泥腥味，影响食欲，所以最好去掉。",
       "imgsrc":"../../images/芦笋鸡肉随行杯.jpg",
     },
     {
       "id":2,
       "title":"紫薯圣女果西蓝花瘦身餐",
       "description":"原料：西蓝花、圣女果、紫薯、盐、食用油",
       "methos":"1：此菜都是本身十分鲜美的食材，所以不用加味精，以免破坏海鲜原本的鲜味。2：虾本身是咸的，日本豆腐也是咸的，所以盐的用量要酌情添加。以免太咸。3：虾背上的虾线，是虾未排泄完的废物，假如吃到口内有泥腥味，影响食欲，所以最好去掉。",
       "imgsrc":"../../images/紫薯圣女果西蓝花瘦身餐.jpg"
     },
     {
       "id":3,
       "title":"红枣燕窝炖",
       "description":"原料：燕窝、红枣、莲子、木耳",
       "methos":"1：此菜都是本身十分鲜美的食材，所以不用加味精，以免破坏海鲜原本的鲜味。2：虾本身是咸的，日本豆腐也是咸的，所以盐的用量要酌情添加。以免太咸。3：虾背上的虾线，是虾未排泄完的废物，假如吃到口内有泥腥味，影响食欲，所以最好去掉。",
       "imgsrc":"../../images/红枣燕窝炖.jpg"
     },
     {
       "id":4,
       "title":"养生南瓜饮",
       "description":"原料：黄豆、南瓜、花生仁、玉米渣、清水",
       "methos":"1：此菜都是本身十分鲜美的食材，所以不用加味精，以免破坏海鲜原本的鲜味。2：虾本身是咸的，日本豆腐也是咸的，所以盐的用量要酌情添加。以免太咸。3：虾背上的虾线，是虾未排泄完的废物，假如吃到口内有泥腥味，影响食欲，所以最好去掉。",
       "imgsrc":"../../images/养生南瓜饮.jpg"
     },
     {
       "id":5,
       "title":"木瓜杂豆鸡肉煲",
       "description":"原料：鸡腿、鸡脚、木瓜、杂豆（自配）200克（黄豆、红、花生米、大枣、葱段、姜片、盐",
       "methos":"1：此菜都是本身十分鲜美的食材，所以不用加味精，以免破坏海鲜原本的鲜味。2：虾本身是咸的，日本豆腐也是咸的，所以盐的用量要酌情添加。以免太咸。3：虾背上的虾线，是虾未排泄完的废物，假如吃到口内有泥腥味，影响食欲，所以最好去掉。",
       "imgsrc":"../../images/木瓜杂豆鸡肉煲.jpg"
     },
     {
      "id":6,
      "title":"海洋明珠",
      "methos":"1：此菜都是本身十分鲜美的食材，所以不用加味精，以免破坏海鲜原本的鲜味。2：虾本身是咸的，日本豆腐也是咸的，所以盐的用量要酌情添加。以免太咸。3：虾背上的虾线，是虾未排泄完的废物，假如吃到口内有泥腥味，影响食欲，所以最好去掉。",
      "description":"原料：鸡日本豆腐、活虾、鱼肉、葱姜、料酒、水淀粉、食盐",
      "imgsrc":"../../images/海洋明珠.jpg"
    },
    {
      "id":7,
      "title":"银耳雪梨汤",
      "description":"原料：水分银耳、梨子、冰糖",
      "methos":"1银耳雪梨汤食材。2银耳摘成小朵洗净备用。3雪梨清洗干净切成小块。4银耳先放入汤锅上火煮开转小火焖30分钟。5然后放入冰糖和切好的梨大火煮开后转小火煮10分钟即可.6做好的汤稍微晾一下喝",
      "imgsrc":"../../images/银耳雪梨汤.jpg"
    },
    {
      "id":8,
      "title":"当归炖羊肉",
      "description":"原料：羊肉、当归、老姜、盐、料酒、鸡精、油",
      "methos":" 1准备好羊肉、老姜和当归。2羊肉、生姜切片，当归洗净掰开。 3羊肉在沸水里焯去血水。锅放油，爆香姜片。5放入羊肉和当归翻炒。6加入适量清水大火煮沸。7加入料酒转中火炖至羊肉软烂。 8加入盐、鸡精调味即可。",
      "imgsrc":"../../images/当归炖羊肉.jpg"
    },
    {
      "id":9,
      "title":"金钩鲍",
      "description":"原料：鲍鱼、小棠菜、南瓜、姜、鲍鱼汁、上汤、淀粉、盐",
      "methos":"1材料备好。2鲍鱼用牙刷洗净黑边，去除肚肠（买回来的时候，我已叫商家将鲍鱼肉和壳分开）。3将鲍鱼切成十字刀花待用。4锅下适量清水烧开后，放入1茶匙盐，再放入小棠菜焯烫。5另起锅倒入南瓜汁、2汤匙鲍鱼汁和1/2茶匙盐。",
      "imgsrc":"../../images/金钩鲍.jpg"
    },
    ]
  }
})
